dist/libros.html
<!--?xml version="1.0" encoding="utf-8"?--><!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en"><head>
<!-- 2021-03-31 mié 00:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Libros de Formación</title>
<meta name="generator" content="Org mode">
<meta name="author" content="jelou">
</head>
<body>
<div id="content">
<h1 class="title">Libros de Formación</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgff428f4">1. Otros</a></li>
<li><a href="#org8291697">2. Programación</a></li>
<li><a href="#org1faf2b2">3. Blogs</a></li>
<li><a href="#orga3c8156">4. Youtube</a>
<ul>
<li><a href="#org507febc">4.1. Modelado</a></li>
<li><a href="#org48d9f08">4.2. Especificación y Requisitos</a>
<ul>
<li><a href="#orgba5d02c">4.2.1. UCAM - Universidad Catolica de Murcia</a></li>
<li><a href="#org51b08c5">4.2.2. Otros</a></li>
</ul>
</li>
<li><a href="#orge912280">4.3. Historias de Usuario - User Stories</a>
<ul>
<li><a href="#orga1375fb">4.3.1. Conceptos</a></li>
<li><a href="#org22e9952">4.3.2. Referencias</a></li>
</ul>
</li>
<li><a href="#org3216659">4.4. Impact Mapping</a></li>
<li><a href="#orgde5b644">4.5. Puntos de Historia</a></li>
<li><a href="#orge8e3f32">4.6. Product Backlog</a>
<ul>
<li><a href="#org85d485c">4.6.1. Mejores</a></li>
</ul>
</li>
<li><a href="#orgcb72e86">4.7. Burndown Chart - Grafica de scrum</a></li>
<li><a href="#org519579f">4.8. Requesitos Funciones y NO funcionales</a></li>
<li><a href="#org7b1ad79">4.9. Usando Jira con Scrum</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Blogs y Libros interesantes para mejorar mi formación académica
</p>

<div id="outline-container-orgff428f4" class="outline-2">
<h2 id="orgff428f4"><span class="section-number-2">1</span> Otros</h2>
</div>

<div id="outline-container-org8291697" class="outline-2">
<h2 id="org8291697"><span class="section-number-2">2</span> Programación</h2>
</div>
<div id="outline-container-org1faf2b2" class="outline-2">
<h2 id="org1faf2b2"><span class="section-number-2">3</span> Blogs</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://devexperto.com/principio-responsabilidad-unica">https://devexperto.com/principio-responsabilidad-unica</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga3c8156" class="outline-2">
<h2 id="orga3c8156"><span class="section-number-2">4</span> Youtube</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org507febc" class="outline-3">
<h3 id="org507febc"><span class="section-number-3">4.1</span> Modelado</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=y3MWfPDmVqo">Javascript Kata - Clean Code y Buenas practicas</a></li>
<li><a href="https://www.youtube.com/watch?v=y3MWfPDmVqo">Codigo Limpio- El arte de construir software</a></li>
<li><a href="https://www.youtube.com/watch?v=y3MWfPDmVqo">Refactor de Code Smells - Clean Code</a></li>
<li><a href="https://www.youtube.com/watch?v=y3MWfPDmVqo">Refactoring Tips - De codigo a Codigo Limpio</a></li>
<li><a href="https://www.youtube.com/watch?v=y3MWfPDmVqo">Solid #1 - Principio de INversion de Dependencias</a></li>
<li><a href="https://www.youtube.com/watch?v=y3MWfPDmVqo">Solid #2 - Errores comunes al diseñar interfaces</a></li>
<li><a href="https://www.youtube.com/watch?v=y3MWfPDmVqo">Clean Architecture - Uncle bob</a></li>
<li><a href="https://www.youtube.com/watch?v=y3MWfPDmVqo">Arquitectura Hexagonal #1 - DDD</a></li>
<li><a href="https://www.youtube.com/watch?v=y3MWfPDmVqo">Arquitectura Hexagonal #2 - DDD - Domain DRive Design</a></li>
</ul>
</div>
</div>

<div id="outline-container-org48d9f08" class="outline-3">
<h3 id="org48d9f08"><span class="section-number-3">4.2</span> Especificación y Requisitos</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-orgba5d02c" class="outline-4">
<h4 id="orgba5d02c"><span class="section-number-4">4.2.1</span> UCAM - Universidad Catolica de Murcia</h4>
<div class="outline-text-4" id="text-4-2-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=AbwwtjOfJIY">Ingenieria de Requisitos - Conceptos Basicos</a></li>
<li><a href="https://www.youtube.com/watch?v=gagdT0gJyqA">Especificacion de REquisitos</a></li>
</ul>
</div>
</div>

<div id="outline-container-org51b08c5" class="outline-4">
<h4 id="org51b08c5"><span class="section-number-4">4.2.2</span> Otros</h4>
<div class="outline-text-4" id="text-4-2-2">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=4q2yBHjceLQ">https://www.youtube.com/watch?v=4q2yBHjceLQ</a></li>
<li><a href="https://www.youtube.com/watch?v=19sxPKlH2eo">https://www.youtube.com/watch?v=19sxPKlH2eo</a></li>
<li><a href="https://www.youtube.com/watch?v=nH4l2NfEesU">https://www.youtube.com/watch?v=nH4l2NfEesU</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge912280" class="outline-3">
<h3 id="orge912280"><span class="section-number-3">4.3</span> Historias de Usuario - User Stories</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-orga1375fb" class="outline-4">
<h4 id="orga1375fb"><span class="section-number-4">4.3.1</span> Conceptos</h4>
</div>
<div id="outline-container-org22e9952" class="outline-4">
<h4 id="org22e9952"><span class="section-number-4">4.3.2</span> Referencias</h4>
<div class="outline-text-4" id="text-4-3-2">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=txOLx58sT5g">User Story mapping - cris rua</a></li>
<li><a href="https://www.youtube.com/watch?v=FJuq_lrM5Cc">Historias de Usuario - Jorge Ruiz Agile</a></li>
<li><a href="https://www.youtube.com/watch?v=ky6wFiF5vMk">Como crear historias de usuario -  Cris Rua</a></li>
<li><a href="https://www.youtube.com/watch?v=Ueq786iZ30I">Como dividir las historias de usuario  en tareas - Cris rua</a></li>
<li><a href="https://www.youtube.com/watch?v=PEaqUlwyDS4">Ing. de requisitos - UPM</a></li>
<li><a href="https://www.youtube.com/watch?v=FJuq_lrM5Cc">https://www.youtube.com/watch?v=FJuq_lrM5Cc</a></li>
<li><a href="https://www.youtube.com/watch?v=Zi9E1aUO_1U">https://www.youtube.com/watch?v=Zi9E1aUO_1U</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3216659" class="outline-3">
<h3 id="org3216659"><span class="section-number-3">4.4</span> Impact Mapping</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=dt-EIN8dBbY">Impact mapping - Como iniciar un proyecto - Cris rua</a></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tipo de Meta</th>
<th scope="col" class="org-left">&nbsp;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">(S)pecific</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">(M)easurable</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">(A)lcanzable</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">(R)elevant</td>
<td class="org-left">&nbsp;</td>
</tr>

<tr>
<td class="org-left">(T)emporal</td>
<td class="org-left">&nbsp;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgde5b644" class="outline-3">
<h3 id="orgde5b644"><span class="section-number-3">4.5</span> Puntos de Historia</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=4I6F0nSCdmE">Puntos de Historia Vs horas - Cris Rua</a></li>
<li><a href="https://www.youtube.com/watch?v=O-D22kLYi2M">Estimacion de puntos de historia - Cris rua</a></li>
<li><a href="https://www.youtube.com/watch?v=ey6Pm46WXkY">Scrum Poker - Estimacion y Planeación del Scrum - Cris rua</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge8e3f32" class="outline-3">
<h3 id="orge8e3f32"><span class="section-number-3">4.6</span> Product Backlog</h3>
<div class="outline-text-3" id="text-4-6">
</div>
<div id="outline-container-org85d485c" class="outline-4">
<h4 id="org85d485c"><span class="section-number-4">4.6.1</span> Mejores</h4>
<div class="outline-text-4" id="text-4-6-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=JuIVHk1wvcw">https://www.youtube.com/watch?v=JuIVHk1wvcw</a></li>
<li></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgcb72e86" class="outline-3">
<h3 id="orgcb72e86"><span class="section-number-3">4.7</span> Burndown Chart - Grafica de scrum</h3>
<div class="outline-text-3" id="text-4-7">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=_7NJpxMT54U">Burndown chart - Cris Rua</a></li>
</ul>
</div>
</div>
<div id="outline-container-org519579f" class="outline-3">
<h3 id="org519579f"><span class="section-number-3">4.8</span> Requesitos Funciones y NO funcionales</h3>
</div>
<div id="outline-container-org7b1ad79" class="outline-3">
<h3 id="org7b1ad79"><span class="section-number-3">4.9</span> Usando Jira con Scrum</h3>
<div class="outline-text-3" id="text-4-9">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=t4w8E2dKtQ8">COmo usar Kanban - Cris Rua</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jelou</p>
<p class="date">Created: 2021-03-31 mié 00:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>


</body></html>